app/views/books/_index.html.erb

SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 2]]
---
        <td>
           <p>コメント数：<%= book.book_comments.count %></p>