app/views/books/show.html.erb

               <%= link_to book_favorites_path(@book), method: :delete do %>
               ♥<%= @book.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]

               <%= link_to book_favorites_path(@book), method: :post do %>
               ♡<%= @book.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]

          </td>
          <td><p>コメント数：<%= @book.book_comments.count %></p></td>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]
SELECT "books".* FROM "books"
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 2]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]

        <tbody>
          <% @book.book_comments.each do |book_comment| %>
---
SELECT "books".* FROM "books"
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 2]]