app/controllers/book_comments_controller.rb

  def create
    book = Book.find(params[:book_id])
    comment = current_user.book_comments.new(book_comment_params)
    comment.book_id = book.id
    if comment.save
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "test1"], ["user_id", 4], ["book_id", 2], ["created_at", "2022-04-30 13:00:11.821690"], ["updated_at", "2022-04-30 13:00:11.821690"]]

  def destroy
    BookComment.find(params[:id]).destroy
---
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 5]]
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]