app/controllers/books_controller.rb

SELECT "books".* FROM "books" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "books"
---
  def index
    @books = Book.page(params[:page])

INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "トラブル知らずのシステム設計"], ["body", "あゝあゝ"], ["created_at", "2022-05-01 22:54:11.951158"], ["updated_at", "2022-05-01 22:54:11.951158"], ["user_id", "23"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book), notice: "You have created book successfully."
    else
      @user = current_user
      @books = Book.all