app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @books = @user.books.page(params[:id])
    @book = Book.new
    @posts = @user.posts.page(params[:page]).reverse_order
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
SELECT "users".* FROM "users" LIMIT ?  [["LIMIT", 11]]
SELECT COUNT(*) FROM "books" WHERE "books"."user_id" = ?  [["user_id", "23"]]
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def index
    @book = Book.new
    @user = current_user
    @users = User.page(params[:page])
---
SELECT "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"

  def update
     @user = User.find(params[:id])
     @books = Book.all
    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", "test"], ["updated_at", "2022-04-25 13:21:24.469096"], ["id", 18]]